Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བདག་གིས་མ་ག་དྷཱའི་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་བྲམ་ཟེ་དབྱར་བྱེད་ལགས་པར་ཐོས་སོ།
en: “Honored One, I have heard that it is the brahmin Varśākāra, chief minister of Magadha.”

source: །ཀུན་དགའ་བོ་ལེགས་སོ། །ལེགས་སོ།
en: “Good, good, Ānanda!

source: །མ་ག་དྷཱའི་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་བྲམ་ཟེ་དབྱར་བྱེད་ནི་མཁས་པ་ཡིན་ཏེ། འདི་ལྟར་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་ལྷན་ཅིག་བགྲོས་པ་ལྟ་ཞིག །ཀུན་དགའ་བོ་འདི་ང་འདུག་གནས་ན་ཉིན་པར་གྱི་གནས་པས་བཞུགས་པ་ན་ལྷའི་སྤྱན་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་དམར་བུ་ཅན་གྱི་གྲོང་ན་མཐུ་ཆེ་བ་མཐུ་ཆེ་བའི་ལྷ་རྣམས་གནས་ཀྱིས་འབྲེ་བ་གཟིགས་སོ།
en: Ānanda, the brahmin Varśākāra, chief minister of Magadha, is wise as if he had consulted the Thirty-Three Gods. Ānanda, when I was dwelling for the day in the residence here, I saw with my divine sight, which is pure and surpasses that of humans, gods of great power covering the ground in Pāṭali Village.

source: །ཀུན་དགའ་བོ་ཕྱོགས་གང་དུ་མཐུ་ཆེ་བ་མཐུ་ཆེ་བའི་ལྷ་རྣམས་ཀྱིས་གནས་ཀྱིས་བྲེས་པའི་ཕྱོགས་དེར་འདི་ལྟ་སྟེ། གནས་ཀྱི་ཕྱིར་མཐུ་ཆེ་བ་མཐུ་ཆེ་བའི་མི་རྣམས་ཀྱི་སེམས་གཞོལ་བར་འགྱུར་རོ།
en: Ānanda, wherever gods of great power cover the ground, people of great power intend to live.

source: །ཕྱོགས་གང་དུ་ལྷ་བར་མ་དང་ཕལ་པས་གནས་ཀྱིས་བྲེས་པའི་ཕྱོགས་དེར་ནི་འདི་ལྟ་སྟེ།
en: Wherever gods of middling and average power cover the ground, people of middling and average power intend to live.

source: གནས་ཀྱི་ཕྱིར་མི་བར་མ་དང་ཕལ་པ་རྣམས་ཀྱི་སེམས་གཞོལ་བར་འགྱུར་རོ། །ཀུན་དགའ་བོ་ཕྱོགས་འདིར་ནི་མཐུ་ཆེ་བ་མཐུ་ཆེ་བའི་ལྷ་རྣམས་ཀྱིས་གནས་ཀྱིས་བྲེས་པས་ཕྱོགས་འདིར་འདི་ལྟ་སྟེ། གནས་ཀྱི་ཕྱིར་དབང་ཆེ་བ་དབང་ཆེ་བར་གྲགས་པའི་མི་རྣམས་ཀྱི་སེམས་གཞོལ་བར་གྱུར་ཏེ།
en: Ānanda, because in this place gods of great power are covering the ground, people of great power will intend to live in this place.

source: ཀུན་དགའ་བོ་ཡ་རབས་ཀྱི་གནས་དང་། ཡ་རབས་ཀྱི་ཐ་སྙད་ཇི་སྙེད་པ་དང་། ཟོང་འགྲེམས་པ་རྣམས་ཀྱི་ནང་ན་ཡང་འདི་ལྟ་སྟེ། དམར་བུ་ཅན་གྱི་གྲོང་ཁྱེར་འདི་མཆོག་ཏུ་འགྱུར་རོ།
en: Ānanda, this city of Pāṭaliputra will be the best of places for trading as long as there are noble dwelling places and noble conduct.

source: །ཀུན་དགའ་བོ་འདི་ལ་བར་ཆད་གསུམ་འབྱུང་བར་རིག་པར་བྱ་སྟེ། མེ་དང་། ཆུ་དང་། ནང་འཁྲུག་གིས་སོ།
en: However, Ānanda, you should know that there will be three types of danger here, namely, the dangers of fire, water, and civil war.”

source: །དེ་ནས་མ་ག་དྷཱའི་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་བྲམ་ཟེ་དབྱར་བྱེད་ཀྱིས་དེ་ཉིད་ཀྱི་ནུབ་མོ་ནས་གཙང་ཞིང་བསོད་པ་ཞེས་བྱ་བ་ནས།
en: Thereupon the brahmin Varśākāra, chief minister of Magadha, prepared a pure and fine meal during the night . . . .

source: ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ཏེ། གསེར་གྱི་བྱ་མ་བུམ་ཐོགས་ཏེ་གསོལ་བ་འདེབས་ཤིང་སྤྱན་སྔར་འདུག་གོ།
en: Knowing that the Blessed One had finished his meal and washed his hands and his bowl, the brahmin held a golden pitcher, sat down in front of the Blessed One, and asked a favor:

source: །འདི་སྐད་ཅེས་ཀྱང་གསོལ་ཏེ། ཀྱེ་གཽ་ཏ་མ་སྦྱིན་པ་འདི་ལས་བསོད་ནམས་ཀྱི་རྒྱུ་མཐུན་པ་དང་། དགེ་བའི་རྒྱུ་མཐུན་པ་དང་། བདེ་བའི་གཞི་ཅི་མཆིས་པ་དེ་དམར་བུ་ཅན་ན་གནས་པའི་ལྷ་རྣམས་ཀྱི་ཡུན་རིང་པོའི་དོན་དང་། ཕན་པ་དང་བདེ་བའི་སླད་དུ་ཡོན་བསྔོ་བ་མཛད་དུ་གསོལ།
en: “O Gautama, please assign the outcome of the merits, the outcome of the virtue, and the roots of happiness that will be generated from this offering to the gods living in Pāṭali for the sake of their everlasting prosperity, benefit, and happiness.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: The Blessed One then spoke these verses:

source: སྐྱེས་བུ་གང་ཟག་དད་པ་ཅན།
en: “One who has faith

source: །གང་ཞིག་ལྷ་རྣམས་མཆོད་བྱེད་པ།
en: And venerates the gods

source: །སྟོན་པའི་བཀའ་བཞིན་བྱེད་པ་སྟེ།
en: Practices as the Teacher taught,

source: །དེ་ནི་སངས་རྒྱས་རྣམས་ཀྱིས་བསྔགས།
en: And he is praised by the buddhas.

source: །མཁས་ཤིང་ཡིད་ནི་གཞུངས་པ་ཡིས།
en: “One who is wise and attentive should,

source: །གང་གི་ཕྱོགས་སུ་གནས་འཆའ་བ།
en: Where he prepares his residence,

source: །ཚུལ་ཁྲིམས་ལྡན་པ་བཤོས་གསོལ་ནས།
en: Offer a meal to a virtuous one

source: །དེ་ཡི་འོག་ཏུ་ཡོན་བསྔོ་བྱ།
en: And thereupon assign the rewards of the offering to the gods.

source: །དེ་རྣམས་རྗེད་པས་རྗེད་འགྱུར་ཞིང་།
en: “Such people will be respected due to their respect

source: །མཆོད་པས་ཀྱང་ནི་མཆོད་པར་འགྱུར།
en: And venerated due to their veneration.

source: །དེ་ནས་ལྟོ་ནས་བྱུང་བ་ཡི།
en: Then the gods will love him

source: །བུ་ལ་མ་བཞིན་འདི་ལ་བརྩེ།
en: Just as a mother loves a son born from her own womb.

source: །ལྷ་རྣམས་བརྩེ་བའི་སྐྱེས་བུས་ནི།
en: One who is loved by the gods

source: །བདེ་བ་བཟང་པོ་མཐོང་བར་འགྱུར།
en: Will see happiness.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མ་ག་དྷཱའི་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་བྲམ་ཟེ་དབྱར་བྱེད་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་ཡང་དག་པར་བསྟན་ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ།
en: Thereupon the Blessed One, having instructed, inspired, encouraged, and delighted the brahmin Varśākāra, chief minister of Magadha, through talk consistent with the Dharma, rose from his seat and departed.

source: །དེ་ནས་མ་ག་དྷཱའི་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་བྲམ་ཟེ་དབྱར་བྱེད་ཀྱིས་དེར་རྒྱུ་ལྷག་གང་ཡིན་པ་དེ་ཐམས་ཅད་སྦྱིན་པར་བཏང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་རྗེས་བཞིན་རྗེས་བཞིན་དུ་འབྲང་ཞིང་།
en: The brahmin Varśākāra, chief minister of Magadha, then relinquished all the leftovers of the meal and followed the Blessed One.

source: འདི་སྙམ་དུ་སེམས་ཀྱིས་སེམས་ལ་མངོན་པར་འདུ་བྱེད་དེ། བཅོམ་ལྡན་འདས་གཽ་ཏ་མ་དམར་བུ་ཅན་གྱི་གྲོང་གི་སྒོ་གང་ནས་ཕྱིར་གཤེགས་པ་དེ་ནི་བདག་གིས་གཽ་ཏ་མའི་སྒོ་ཞེས་གདགས་སོ། །ཆུ་བོ་གང་གཱའི་འཇུག་ངོགས་གང་ནས་རྒལ་བ་དེ་ཡང་གཽ་ཏ་མའི་འཇུག་ངོགས་ཞེས་གདགས་སོ་སྙམ་མོ།
en: He thought to himself, “I will name the gate of Pāṭali Village through which the Blessed One Gautama leaves ‘Gautama Gate.’ And I will also name the ford where he crosses the Ganges ‘Gautama Ford.’ ”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐུགས་ཀྱིས་མ་ག་དྷཱའི་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་བྲམ་ཟེ་དབྱར་བྱེད་ཀྱི་བསམ་པ་མཁྱེན་ནས། དམར་བུ་ཅན་གྱི་གྲོང་གི་དབུས་ཐོག་ཐག་གཤེགས་ནས་བྱང་ཕྱོགས་སུ་རྒྱུ་སྟེ།
en: The Blessed One, knowing the mind of the brahmin Varśākāra, chief minister of Magadha, with his own mind, went through Pāṭali Village to the north and arrived where the Ganges was located. C.

source: ཆུ་བོ་གང་གཱ་གང་ན་བར་གཤེགས་སོ།
en: The Donation of Parasols

source: །དེ་ནས་ལུས་འཕགས་མའི་བུ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདི་སྙམ་དུ་སེམས་ཏེ། མ་ལ་བདག་ཉིད་ཁོ་ནས་བཅོམ་ལྡན་འདས་མཆོད་པ་བྱ་བ་ལ་ལྷག་པར་སྤྲོ་བར་བྱའོ་སྙམ་དུ་བསམས་ནས། རྩིབས་བརྒྱ་དང་ལྡན་པའི་གདུགས་ལྔ་བརྒྱ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་སྟེང་དུ་བཟུང་བ་དང་། ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ཀྱིས་བསམས་པ།
en: Then King Ajātaśatru, son of Vaidehī, thought, “Now, I am the very person who must make an effort to venerate the Blessed One.” With this thought in mind, he had five hundred parasols, each of which had a hundred spokes, raised over the Blessed One’s head.

source: ལུས་འཕགས་མའི་བུ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདི་བཅོམ་ལྡན་འདས་མཆོད་པ་ལ་རང་ཉིད་ལྷག་པར་སྤྲོ་བར་གྱུར་ན། ཅིའི་ཕྱིར་ན་བདག་ཅག་གིས་སྤྲོ་བར་མི་བྱ་སྙམ་ནས་དེ་རྣམས་ཀྱིས་ཀྱང་རྩིབས་བརྒྱ་དང་ལྡན་པའི་གདུགས་ལྔ་བརྒྱ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་སྟེང་དུ་བཟུང་ངོ་།
en: The people of the Licchavi clan in Vaiśālī thought, “If this King Ajātaśatru, son of Vaidehī, makes an effort to venerate the Blessed One more and more, why should we not make an effort, too?” They also had five hundred parasols, each of which had a hundred spokes, raised over the Blessed One’s head.

source: །ཀླུ་རྣམས་ཀྱིས་བསམས་པ། རེ་ཞིག་མི་འདི་རྣམས་བཅོམ་ལྡན་འདས་མཆོད་པ་བྱ་བ་ལ་ལྷག་པར་སྤྲོ་བར་གྱུར་ན། བདག་ཅག་ཀླུ་རྣམས་ནི་རྣམ་པར་ལྷུང་བའི་ལུས་ཅན་ཡིན་ན་ཅིའི་ཕྱིར་བདག་ཅག་སྤྲོ་བར་མི་བྱ་སྙམ་ནས། དེ་དག་གིས་ཀྱང་རྩིབས་བརྒྱ་དང་ལྡན་པའི་གདུགས་ལྔ་བརྒྱ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་སྟེང་དུ་བཟུང་ངོ་།
en: The nāgas thought, “If these humans make such an effort to venerate the Blessed One more and more, why should we not make an effort, too, even though we nāgas are ones whose bodies are inferior?” They also had five hundred parasols, each of which had a hundred spokes, raised over the Blessed One’s head.

source: །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་བསམས་པ། རེ་ཞིག་མི་བསོད་ནམས་མངོན་སུམ་དུ་མ་མཐོང་བ་འདི་དག་ཀྱང་བཅོམ་ལྡན་འདས་མཆོད་པ་བྱ་བ་ལ་ལྷག་པར་སྤྲོ་བར་གྱུར་ན། མངོན་སུམ་དུ་མཐོང་བ་བདག་ཅག་གིས་ལྟ་ཅིའི་ཕྱིར་སྤྲོ་བར་མི་བྱ་སྙམ་ནས། དེ་རྣམས་ཀྱིས་ཀྱང་རྩིབས་བརྒྱ་དང་ལྡན་པའི་ལྷའི་གདུགས་ལྔ་བརྒྱ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་སྟེང་དུ་བཟུང་ངོ་།
en: The gods attendant on the Four Great Kings thought, “If these humans, who do not understand merit, make such an effort to venerate the Blessed One more and more, why shouldn’t we, who do understand merit, make an effort, too?” They also had five hundred parasols, each of which had a hundred spokes, raised over the Blessed One’s head.

source: །སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱིས་བསམས་པ། ལྷ་དང་མི་འདི་རྣམས་བཅོམ་ལྡན་འདས་མཆོད་པ་བྱ་བ་ལ་སྤྲོ་བར་གྱུར་ན། བདག་ཅག་གིས་ཅིའི་ཕྱིར་སྤྲོ་བར་མི་བྱ་སྙམ་ནས། དེ་དག་གིས་ཀྱང་རྩིབས་བརྒྱ་དང་ལྡན་པའི་གདུགས་ལྔ་བརྒྱ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་སྟེང་དུ་བཟུང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: The Thirty-Three Gods thought, “If these gods and humans make such an effort to venerate the Blessed One more and more, why should we not make an effort, too?” They also had five hundred parasols, each of which had a hundred spokes, raised over the Blessed One’s head.

source: ཇི་ལྟར་འདི་དག་ཕྱིར་ཞིང་དད་པ་མངོན་པར་འཕེལ་བར་འགྱུར་བ་དེ་ལྟར་བྱིན་གྱིས་བརླབ་བོ་སྙམ་ནས་དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་རེ་རེའི་ཡིད་ལ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་སྟེང་ན་བདག་གདུགས་འཛིན་ཏོ་སྙམ་པ་དེ་ལྟར་བྱིན་གྱིས་བརླབས་ཏེ།
en: The Blessed One thought, “I will exercise my magical powers so that they greatly expand their aspiration.” Then the Blessed One exercised his magical powers so that each of them thought in their mind, “I am the very person who is raising a parasol over the Blessed One’s head.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ལ་གདུགས་ཉིས་སྟོང་ལྔ་བརྒྱ་ལྷ་དང་མི་རྣམས་ཀྱིས་སྟེང་དུ་བཟུང་ངོ་།
en: Thus, gods and humans there raised twenty-five hundred parasols over the Blessed One, the Completely Awakened One. D. A Story of a Former Life of the Buddha: King Mahāsudarśana

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྲིན་ལས་ཅི་ཞིག་མཛད་ན། དེས་ན་བཅོམ་ལྡན་འདས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ལ་གདུགས་ཉིས་སྟོང་ལྔ་བརྒྱ་ལྷ་དང་མི་རྣམས་ཀྱིས་དབུའི་གཙུག་གི་སྟེང་དུ་བཟུང་བར་གྱུར་ལགས།
en: All the monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did the Blessed One create that matured to cause gods and humans to raise twenty-five hundred parasols over the head of the Blessed One, the Completely Awakened One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་སྔོན་གྱི་ཚེ་རབས་གཞན་ན་ལས་བྱས་ཤིང་བསགས་པ་ཚོགས་རྙེད་པ་ཞེས་བྱ་བ་ནས།
en: The Blessed One said, “Monks, the actions were performed and accumulated by the Tathāgata himself . . . . “. . .

source: ལུས་ཅན་རྣམས་ལ་འབྲས་བུར་འགྱུར་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: They bear fruit in embodied beings.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མཐའ་བཞིར་རྣམ་པར་རྒྱལ་བ་ཆོས་དང་ལྡན་པ། ཆོས་ཀྱི་རྒྱལ་པོ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ལེགས་མཐོང་ཆེན་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Monks, once there appeared a wheel-turning king named Mahāsudarśana, who had conquered the border regions in the four directions, was a righteous Dharma king, and had attained the seven treasures.

source: རྒྱལ་པོ་དེ་ལ་བུ་སྟོང་དུ་གཅིག་གིས་མ་ཚང་བ་ཞིག་ཡོད་དོ།
en: The king had ninety-nine sons.

source: །རྒྱལ་པོ་དེའི་ཀུན་དུ་སྤྱོད་པ་ནི་བུ་བཙས་ཤིང་བཙས་པ་དག་ཕྱི་བཞིན་ཁྲིད་དེ་འཁྱམ་པར་བྱེད་དོ།
en: Whenever the king went out, he always took all of his sons along.

source: །བཙུན་མོ་རྣམས་ཀྱིས་བསམས་པ། རྒྱལ་པོ་འདིའི་ཀུན་དུ་སྤྱོད་པ་ནི་སྲས་བཙས་ཤིང་བཙས་པ་དག་ཕྱི་བཞིན་ཁྲིད་ནས་འཁྱམ་པར་མཛད་པས་བདག་ཅག་བུ་ཡོད་བཞིན་དུ་བུ་མེད་པ་དང་འདྲས། ད་ནི་ནང་ཁྲིམས་ཞིག་བཅའ་སྟེ། གལ་ཏེ་བདག་ཅག་ལས་འགའ་ཞིག་སེམས་ཅན་དང་ལྡན་པར་གྱུར་ན།
en: His consorts thought, ‘Since whenever this king goes out, he always takes all of his sons along, we are as good as sonless even though we do have sons.

source: དེས་རྒྱལ་པོ་ལ་གདས་པར་མི་བྱའོ་ཞེས་བཅས་སོ།
en: Now let us make it a rule that if one of us conceives a child, she must not inform the king.’

source: །ཇི་ཙམ་ན་བཙུན་མོ་གཞན་ཞིག་སེམས་ཅན་དང་ལྡན་པར་གྱུར་ནས།
en: “Later, one of the consorts did conceive a child.

source: དེ་དེ་དག་གིས་ཕྱོགས་དབེན་པ་ཞིག་ཏུ་བཞག་སྟེ། དེ་ཟླ་བ་བརྒྱད་དམ་དགུ་འདས་པ་དང་ཁྱེའུ་གཟུགས་བཟང་བ། བལྟ་ན་སྡུག་པ།
en: She was kept in a secret place by the other consorts, and after eight or nine months a boy was born.

source: མཛེས་པ། པགས་པའི་མདོག་གསེར་འདྲ་བ་མགོ་གདུགས་ལྟ་བུ། ལག་པ་རིང་བ། འཕྲལ་བའི་དབྱེས་ཆེ་བ། སྨིན་མ་འཇར་བ་སྣའི་གཟངས་མཐོ་བ།
en: He was well proportioned, pleasant to behold, and attractive, with a golden complexion, his head like a parasol, long arms, a broad forehead, eyebrows that meet, a prominent nose, and every major limb and minor appendage of his body complete.

source: ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་དང་ལྡན་པ་ཞིག་བཙས་སོ། །ཇི་ཙམ་ན་ཆེན་པོར་གྱུར་པ་དང་བཙུན་མོ་དེ་དག་ཐམས་ཅད་ཁྱེའུ་དེ་ལ་བུའི་སྡུག་པ་སྐྱེས་སོ།། །།འདུལ་བ་གཞི།
en: When he grew up, every consort loved the boy as if he were her own son.

source: བམ་པོ་ཉི་ཤུ་བདུན་པ། དེ་ནས་དུས་གཞན་ཞིག་ན་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་ནས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་སྣ་དྲངས་ཤིང་ཁམས་ཀྱི་རྒྱལ་ཕྲན་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ་བུ་སྟོང་དུ་གཅིག་གིས་མ་ཚང་བས་ཟླ་བ་ཁམ་པ་ལྟ་བུར་བསྐོར་ནས། གཟི་བརྗིད་ཉི་མའི་འོད་ཟེར་སྟོང་བས་ལྷག་པར་སྤ་ཞིང་འོང་བ་གཞོན་ནུ་ཁང་བཟངས་ཀྱི་སྟེང་ན་འདུག་པ་དེས་མཐོང་ནས།
en: “One day King Mahāsudarśana came back from the eastern continent of Videha preceded by the seven treasures, surrounded by a thousand neighboring minor kings, surrounded also by his ninety-nine sons lined up in the shape of a half-moon, and most beautifully shining with his brilliance like the light of a thousand suns.

source: དེས་མ་ལ་དྲིས་པ། ཡུམ་མཆི་བ་ཕ་བི་སུ་ལགས།
en: His newest son, who was on the terrace, saw the king and asked his mother, ‘Mother, who is coming there?’

source: བུ་ཁྱོད་ཀྱི་ཡབ་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ཡིན་ནོ།
en: “ ‘My son, that is your father, King Mahāsudarśana.’

source: །ཡུམ་དེ་འདས་ན་བདག་རྒྱལ་པོར་འགྱུར་རམ།
en: “ ‘Mother, will I become king when he dies?’

source: བུ་རྒྱལ་པོ་དེའི་སྲས་སྟོང་དུ་གཅིག་གིས་མ་ཚང་བ་ཞིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཕུ་བོ་གང་ཡིན་པ་དེ་དེ་འདས་ན་རྒྱལ་པོར་འགྱུར་ན་ཁྱོད་ནི་ཐམས་ཅད་ཀྱི་ནུ་བོ་ཡིན་ནོ།
en: “ ‘My son, the king has ninety-nine other sons, and the eldest of them will become king when the king dies. You are the youngest of them.’

source: །དེས་སྨྲས་པ། ཡུམ་གལ་ཏེ་དེ་འདས་ན་བདག་རྒྱལ་པོར་མི་འགྱུར་ན་གནང་བར་མཛོད་ཅིག་དང་། བདག་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་བར་བགྱིའོ། །བཙུན་མོ་དེ་དག་ཐམས་ཅད་ཀྱིས་སྨྲས་པ།
en: “He then requested of her, ‘Mother, if I will not become king when he dies, please allow me to go forth from my home into homelessness with true faith.’

source: བུ་ཁྱོད་ལ་བདག་ཅག་གིས་བུའི་སྡུག་པ་ཉམས་སུ་མྱོང་གིས་དེ་ལྟར་མ་བྱེད་ཅིག །ཡུམ་གདོན་མི་འཚལ་བར་རབ་ཏུ་འབྱུང་བར་བགྱིའོ།
en: “ ‘O son,’ said all the king’s consorts, ‘do not do that, for we love you as if you were the son of each of us.’ “ ‘Mother, I shall certainly go forth.’

source: །དེ་དག་གིས་དེ་གདོན་མི་ཟ་བར་གལ་གྱིས་འཆུ་བར་ཤེས་ནས་སྨྲས་པ། བུ་གལ་ཏེ་དེ་ལྟ་ན་དམ་ཞིག་བཅས་ནས་གནང་བར་བྱ་སྟེ། གང་ཡང་ཁྱོད་ཀྱིས་ཡོན་ཏན་གྱི་ཚོགས་ཅུང་ཟད་རྟོགས་ན་དེ་ཁྱོད་ཀྱིས་བདག་ཅག་ལ་སྨྲོས་ཤིག །དེ་བཞིན་དུ་བགྱིའོ།
en: “Knowing he would certainly insist, they said, ‘O son, then we shall allow it with the promise that when you have attained any good qualities, you will inform us.’

source: །དེ་དེ་དག་གིས་གནང་ནས་དེས་མཐའ་གཅིག་ཏུ་སོང་སྟེ། མཁན་པོ་དང་སློབ་དཔོན་མེད་པར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་སུམ་བཅུ་རྩ་བདུན་གྱི་ཆོས་བསྐྱེད་ནས་རང་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱས་སོ།
en: “ ‘I shall do so.’ “Having been given permission by them, he went to a solitary place, generated the thirty-seven aspects of awakening without any instruction by a preceptor or teacher, and actualized the awakening of a self-awakened one.

source: །རང་སངས་རྒྱས་དེས་བསམས་པ། བདག་གིས་མ་དེ་རྣམས་ལ་ཁས་བླངས་པ་སྨྲ་དགོས་པས་སོང་ལ་སྔོན་གྱི་དམ་བཅས་པ་མཐར་དབྱུང་ངོ་སྙམ་ནས། བདག་ཉིད་ཆེན་པོ་དེ་དག་ནི་ངག་གིས་ཆོས་མི་སྟོན་གྱི་ལུས་ཀྱིས་ཡིན་པས་དེས་དེ་རྣམས་ཀྱི་མདུན་དུ་འབར་བ་དང་། གསལ་བ་དང་། ཆར་འབེབས་པ་དང་། གློག་འབྱིན་པ་དག་གི་ཆོ་འཕྲུལ་དག་བྱ་བར་བརྩམས་སོ།
en: Now a self-awakened one, he thought, ‘Since I must tell those mothers what I have promised to tell them, now I will go and fulfill my former promise.’ Since such great people do not make demonstrations with words but with their bodies, he began to display miracles in their presence, namely, blazing fire, radiating light, causing rain to fall, and causing lightning to strike.

source: །སོ་སོའི་སྐྱེ་བོ་ནི་རྫུ་འཕྲུལ་ལ་མྱུར་དུ་སེམས་གཏོད་པ་ཡིན་པས་དེ་དག་ཤིང་རྩ་བ་ནས་བཅད་པ་བཞིན་རྐང་པ་གཉིས་ལ་གཏུགས་ནས་སྨྲས་པ། འཕགས་པ་ཁྱོད་ཀྱིས་ཡོན་ཏན་གྱི་ཚོགས་འདི་ལྟ་བུ་རྟོགས་སམ། རྟོགས་སོ།
en: Since ordinary people tend to be swiftly attracted by magical powers, they bowed down to his feet like trees that had been cut at the roots and asked, ‘O noble one, have you attained these good qualities?’ “ ‘Yes, I have.’

source: །འཕགས་པ་ཁྱོད་ནི་བསོད་སྙོམས་བཞེད་པ་ལགས་ལ། བདག་ཅག་ཀྱང་བསོད་ནམས་འཚལ་བ་ལགས་ན། ཁྱོད་འདི་ཉིད་དུ་སྐྱེད་མོས་ཚལ་དུ་བཞུགས་ཤིག་དང་། བདག་ཅག་གིས་རྒྱུན་དུ་བསོད་སྙོམས་དབུལ་བར་བགྱིའོ།
en: “ ‘O noble one, since you wish for almsfood and we wish for merit, please stay in this park, and we shall in due course offer you almsfood.’

source: །རང་སངས་རྒྱས་དེས་ཁས་བླངས་ནས་དེ་དག་གིས་རང་སངས་རྒྱས་ལ་བསོད་སྙོམས་ཀྱིས་བཀུར་སྟིར་བྱ་བར་བརྩམས་སོ།
en: “The self-awakened one assented, and the women offered the self-awakened one almsfood.

source: །རང་སངས་རྒྱས་དེས་བསམས་པ། བདག་གི་ལུས་རྣག་ཅན་འདིས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་བྱས་ཀྱིས། མ་ལ་བདག་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་འཇུག་གོ་སྙམ་ནས།
en: The self-awakened one thought, ‘Since I have done what is to be done with this purulent body, I will now enter the realm of emancipation without remainder.’

source: དེ་ནས་དེ་ངང་པའི་རྒྱལ་པོ་འདབ་མ་བརྐྱང་བ་ལྟར་སྟེང་གི་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས་འབར་བ་དང་། གསལ་བ་དང་། ཆར་འབེབས་པ་དང་། གློག་འབྱིན་པའི་ཆོ་འཕྲུལ་དག་ཀྱང་བསྟན་ནས་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པ་ཞི་བའི་དབྱིངས་སུ་ཞུགས་སོ།
en: He then soared high into the sky as if a haṃsa king had stretched its wings and displayed miracles, namely, blazing fire, radiating light, causing rain to fall, and causing lightning to strike, and he entered the realm of peace, which is emancipation without remainder.

source: །དེ་ནས་དེ་དག་གིས་ཤིང་དྲི་ཞིམ་པོ་ཐམས་ཅད་སྤུངས་ཏེ།
en: Thereupon the women piled up pieces of every kind of fragrant wood.

source: སྤུངས་ནས་བསྲེགས་ཏེ་མེའི་ཕུང་པོ་དེ་འོ་མས་བསད་ནས་རུས་པ་དེ་དག་གསེར་གྱི་བུམ་པའི་ནང་དུ་བཅུག་སྟེ།
en: Having piled up all the wood, they cremated his body, poured milk on the fire to put it out, and placed the ashes in a golden urn.

source: སྐྱེད་མོས་ཚལ་དེ་ཉིད་དུ་རུས་པའི་མཆོད་རྟེན་བརྩིགས་ཏེ་མགུལ་གདུབ་དང་། གདུ་བུ་རྒྱན་ཅན་དང་། གཞན་ཡང་རྒྱན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་ཅིང་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དག་བཙུགས་སོ།
en: They built a stūpa for the ashes in the park, adorned it with their necklaces, bracelets, and various kinds of ornaments, and hung on it parasols, banners, and flags.

source: །དེ་ནས་དུས་གཞན་ཞིག་ན་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་བཙུན་མོའི་འཁོར་གྱིས་བསྐོར་ནས་སོ་གའི་དུས་ལ་བབ་པ་ན་མེ་ཏོག་གི་ཤིང་རྣམས་ཁ་འབུས་ཤིང་ངང་པ་དང་། ཀྲུང་ཀྲུང་དང་། རྨ་བྱ་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། བྱ་ཀོ་ཀི་ལ་དང་། ཤང་ཤང་དེའུ་སྐད་འབྱིན་པའི་ཚལ་གསེབ་ཏུ་སྐྱེད་མོས་ཚལ་གྱི་གཞིར་སོང་ནས།
en: “Later, King Mahāsudarśana, surrounded by his consorts, went to the park in the forest where the blossoms of the trees were budding in the spring, and haṃsas, cranes, peacocks, parrots, śārikās, cuckoos, and jīvaṃjīvakas were singing.

source: དེ་སྐྱེད་མོས་ཚལ་ན་འཁྱམ་པ་ལས་དགྲ་བཅོམ་པའི་མཆོད་རྟེན་དེ་མཐོང་ངོ་།
en: Wandering around the park, he saw the stūpa of the arhat.

source: །དེ་ནས་སྐྱེད་མོས་ཚལ་སྲུང་བའི་མི་ལ་སྨྲས་པ། ཀྭའི་ནང་རྗེ་འདི་ཅི་ཡིན།
en: He asked a guardian of the park, ‘Hey, what is this?’

source: དེས་སྨྲས་པ། ལྷ་བདག་གིས་ནི་མ་འཚལ་ཏེ།
en: “ ‘Your Majesty,’ replied the guardian, ‘I do not know.

source: འོན་ཀྱང་འདིའི་དོན་ནི་བཙུན་མོས་འཚལ་ཏོ།
en: But your consorts know what it is.’

source: །དེ་ནས་དེས་བཙུན་མོའི་འཁོར་རྣམས་ལ་སྨྲས་པ་དང་། དེ་དག་གིས་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་སྨྲས་པ། ལྷ་མི་འཇིགས་པ་སྩལ་དུ་གསོལ།
en: “The king then asked his consorts. They threw themselves at his feet and said, ‘Your Majesty, please grant us freedom from the fear of reprisal.’

source: དེས་སྨྲས་པ། དེ་བཞིན་དུ་སྦྱིན་ནོ།
en: “ ‘I will give you what you want,’ he replied.

source: །དེ་དག་གིས་སྐབས་དེ་རྒྱས་པར་སྨྲས་པ་དང་། རྒྱལ་པོས་སྨྲས་པ།
en: “They then explained in detail what had occurred.

source: ཁྱེད་ཅག་གིས་བུ་རྒྱལ་སྲིད་ལ་མངོན་པར་དགའ་ན་དེ་ཁོ་བོ་ལ་མ་གསོལ་བ་བཟང་པོ་མ་ཡིན་བ་ཞིག་བྱས་སོ།
en: The king said to them, ‘It was not good of you that you did not tell me when my son longed for kingship.

source: །གལ་ཏེ་གསོལ་བར་གྱུར་པ་དང་ཁོ་བོ་དེ་ཁོ་ན་ལ་རྒྱལ་སྲིད་ལ་དབང་བསྐུར་བས་དབང་བསྐུར་བར་འགྱུར་བ་ཞིག །འོན་ཀྱང་ངས་བདག་ཉིད་ཆེན་པོ་དེ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཀྱང་གདུགས་དང་། ཅོད་པན་དང་། ཐོར་ཚུགས་གདགས་སོ་ཞེས་དེ་ནས་དེས་བུ་ལ་བྱམས་པས་རང་སངས་རྒྱས་ཀྱི་མཆོད་རྟེན་དེ་ལ་གདུགས་དང་། ཅོད་པན་དང་། ཐོར་ཚུགས་རྣམས་བཏགས་སོ།
en: If you had told me, I would have anointed him as king. But I will hang parasols, a crown, and a turban on the stūpa, even though the great one has already been emancipated and has gone.’ “Then he hung parasols, a crown, and a turban on the stūpa of the self-awakened one out of love for his son.

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་ལེགས་མཐོང་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ།
en: The one who was King Mahāsudarśana at that time, on that occasion, was indeed me.

source: །གང་ཡང་ངས་དེ་ན་བུ་ལ་བྱམས་པས་རང་སངས་རྒྱས་ཀྱི་མཆོད་རྟེན་དེ་ལ་གདུགས་དང་། ཅོད་པན་དང་། ཐོར་ཚུགས་བཏགས་ཏེ། ལས་དེའི་རྣམ་པར་སྨིན་པས་ངས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཉིས་སྟོང་ལྔ་བརྒྱ་བྱས་སོ།
en: Because of the maturation of the action performed by me there, namely, my hanging parasols, a crown, and a turban on the stūpa of the self-awakened one out of love for my son, I became a wheel-turning king twenty-five hundred times.

source: །ལས་དེ་ཁོ་ནའི་ལྷག་མས་ད་ལྟར་ང་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ན་ལྷ་དང་མི་རྣམས་ཀྱིས་རྩིབས་བརྒྱ་དང་ལྡན་པའི་གདུགས་ཉིས་སྟོང་ལྔ་བརྒྱ་དབུའི་གཙུག་གི་སྟེང་དུ་བཟུང་བར་གྱུར་ཏོ།
en: Because of the remains of the action, as a completely awakened one I now had twenty-five hundred parasols, each of which had a hundred spokes, raised over my head by gods and humans.

source: །གལ་ཏེ་ངས་ཡོན་ཏན་གྱི་ཚོགས་འདི་ལྟ་བུ་རྟོགས་པར་མ་གྱུར་ན་གཞན་དུ་ཡང་ངས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཉིས་སྟོང་ལྔ་བརྒྱ་བྱེད་པར་འགྱུར་རོ།
en: If I had not attained a number of good qualities like these, I would have become a wheel-turning king another twenty-five hundred times.

source: །དེ་ལྟ་བས་ན་ངའི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཅན་གང་ཡིན་པ་དེ་ངས་ཉན་ཐོས་རྣམས་ཀྱི་ལོངས་སྤྱོད་དུ་རྣམ་པར་སྨིན་པར་བསྔོས་ཏེ།
en: Therefore, I transferred my merit that would mature later so that it would mature and be enjoyed by my disciples.

source: གལ་ཏེ་མུ་ཏིག་བྲེ་གང་གིས་འབྲས་བྲེ་གང་ཁུགས་ཀྱང་འོན་ཀྱང་ངའི་ཉན་ཐོས་རྣམས་ནི་བསོད་སྙོམས་ཀྱིས་ཕོངས་པར་མི་འགྱུར་རོ།
en: Even if there should be such a serious famine that a droṇa of rice could only be bought for a droṇa of pearls, my disciples will not lack for almsfood.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ་ཞེས་བྱ་བ་ནས་བརྩལ་བར་བྱ་སྟེ།
en: “Therefore, monks, the maturation of entirely negative actions is entirely negative. . . . you should seek entirely positive actions.

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟ་བུ་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Monks, that is how you must train.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། དགེ་སློང་དེ་དག་ཡི་རངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: Thus spoke the Blessed One, and the monks rejoiced in and praised what the Blessed One had said. V. The Ganges

source: ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་གྲུ་ཟམ་འཛུགས་སུ་བཅུག་པ་དང་། ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་གྲུ་ཟམ་བཙུགས་སོ།
en: Ajātaśatru, the king of Magadha, son of Vaidehī, had a bridge of boats placed on the river, and the people of the Licchavi clan in Vaiśālī also made a bridge of boats for the Blessed One.
